In [2]:
import pandas as pd

In [3]:
df = pd.read_csv("titanic.csv")
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace=True)
df.head()

   Survived  Pclass     Sex   Age     Fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833
2         1       3  female  26.0   7.9250
3         1       1  female  35.0  53.1000
4         0       3    male  35.0   8.0500

In [7]:
inputs = df.drop('Survived',axis='columns')
target = df.Survived

In [5]:
#inputs.Sex = inputs.Sex.map({'male': 1, 'female': 2})

In [8]:
dummies = pd.get_dummies(inputs.Sex)
dummies.head(3)

   female  male
0       0     1
1       1     0
2       1     0

In [9]:
inputs = pd.concat([inputs,dummies],axis='columns')
inputs.head(3)

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0

In [10]:
inputs.drop(['Sex','male'],axis='columns',inplace=True)
inputs.head(3)

   Pclass   Age     Fare  female
0       3  22.0   7.2500       0
1       1  38.0  71.2833       1
2       3  26.0   7.9250       1

In [11]:
inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [12]:
inputs.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [13]:
inputs.Age = inputs.Age.fillna(inputs.Age.mean())
inputs.head()

   Pclass   Age     Fare  female
0       3  22.0   7.2500       0
1       1  38.0  71.2833       1
2       3  26.0   7.9250       1
3       1  35.0  53.1000       1
4       3  35.0   8.0500       0

In [14]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(inputs,target,test_size=0.3)

In [15]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [16]:
model.fit(X_train,y_train)

GaussianNB()

In [17]:
model.score(X_test,y_test)

0.7947761194029851

In [18]:
X_test[0:10]

     Pclass        Age      Fare  female
441       3  20.000000    9.5000       0
290       1  26.000000   78.8500       1
258       1  35.000000  512.3292       1
366       1  60.000000   75.2500       1
761       3  41.000000    7.1250       0
737       1  35.000000  512.3292       0
692       3  29.699118   56.4958       0
88        1  23.000000  263.0000       1
434       1  50.000000   55.9000       0
303       2  29.699118   12.3500       1

In [19]:
y_test[0:10]

441    0
290    1
258    1
366    1
761    0
737    1
692    1
88     1
434    0
303    1
Name: Survived, dtype: int64

In [20]:
model.predict(X_test[0:10])

array([0, 1, 1, 1, 0, 1, 0, 1, 0, 1], dtype=int64)

In [21]:
model.predict_proba(X_test[:10])

array([[9.50932564e-01, 4.90674361e-02],
       [2.65450900e-02, 9.73454910e-01],
       [5.50989560e-42, 1.00000000e+00],
       [3.99500363e-02, 9.60049964e-01],
       [9.62396440e-01, 3.76035595e-02],
       [1.55540243e-40, 1.00000000e+00],
       [9.18850870e-01, 8.11491302e-02],
       [9.57953275e-12, 1.00000000e+00],
       [7.12156902e-01, 2.87843098e-01],
       [2.93976739e-01, 7.06023261e-01]])

In [22]:
from sklearn.model_selection import cross_val_score
cross_val_score(GaussianNB(),X_train, y_train, cv=5)

array([0.776     , 0.752     , 0.792     , 0.82258065, 0.73387097])

In [ ]:
#now working on iris dataset

In [25]:
df = pd.read_csv("Iris.csv")
df.head()

   Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
0   1            5.1           3.5            1.4           0.2  Iris-setosa
1   2            4.9           3.0            1.4           0.2  Iris-setosa
2   3            4.7           3.2            1.3           0.2  Iris-setosa
3   4            4.6           3.1            1.5           0.2  Iris-setosa
4   5            5.0           3.6            1.4           0.2  Iris-setosa

In [27]:
inputs = df.drop('Species',axis='columns')
target = df.Species

In [28]:
inputs.columns[inputs.isna().any()]

Index([], dtype='object')

In [29]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(inputs,target,test_size=0.3)

In [30]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [31]:
model.fit(X_train,y_train)

GaussianNB()

In [32]:
model.score(X_test,y_test)

0.9777777777777777

In [33]:
#working on mnist test dataset

In [45]:
df = pd.read_csv("mnist_test.csv")
df.head()

,label,1x1,1x2,1x3,1x4,1x5,1x6,1x7,1x8,1x9,...,28x19,28x20,28x21,28x22,28x23,28x24,28x25,28x26,28x27,28x28
0,7,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
1,2,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
2,1,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
3,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
4,4,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0

In [47]:
inputs = df.drop('label',axis='columns')
target = df.label

In [48]:
inputs.columns[inputs.isna().any()]

Index([], dtype='object')

In [49]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(inputs,target,test_size=0.3)

In [50]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [51]:
model.fit(X_train,y_train)

GaussianNB()

In [52]:
model.score(X_test,y_test)

0.574

In [53]:
df = pd.read_csv("used_cars_data.csv")
df.head()

,Unnamed: 0,brand,model,price (eur),engine,year,mileage (kms),fuel,gearbox,location
0,0,SEAT,Ibiza,8990,SC 1.2 TSI 90cv Style,2016,67000,Gasolina,Manual,Granollers
1,1,Hyundai,i30,9990,1.6 CRDi 110cv Tecno,2014,104868,Diésel,Manual,Viladecans
2,2,BMW,Serie 5,13490,530d Touring,2011,137566,Diésel,Automatica,Viladecans
3,3,Volkswagen,Golf,24990,GTI 2.0 TSI 169kW (230CV),2018,44495,Gasolina,Manual,Viladecans
4,4,Opel,Corsa,10460,1.4 Expression 90 CV,2016,69800,Gasolina,Manual,Sabadell 1

In [54]:
df.drop(['brand','model','engine','fuel','gearbox'],axis='columns',inplace=True)
df.head()

   Unnamed: 0  price (eur)  year  mileage (kms)    location
0           0         8990  2016          67000  Granollers
1           1         9990  2014         104868  Viladecans
2           2        13490  2011         137566  Viladecans
3           3        24990  2018          44495  Viladecans
4           4        10460  2016          69800  Sabadell 1

In [55]:
inputs = df.drop('location',axis='columns')
target = df.location

In [56]:
inputs.columns[inputs.isna().any()]

Index([], dtype='object')

In [57]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(inputs,target,test_size=0.3)

In [58]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [59]:
model.fit(X_train,y_train)

GaussianNB()

In [60]:
model.score(X_test,y_test)

0.13025210084033614